zhanglei033/ln_iot/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32c6"

CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="module_config/partitions.csv"
CONFIG_PARTITION_TABLE_FILENAME="module_config/partitions.csv"

#CONFIG_BT_ENABLED=y
#CONFIG_BT_NIMBLE_ENABLED=y
#CONFIG_BT_CONTROLLER_ENABLED=y
#CONFIG_BT_NIMBLE_BLUFI_ENABLE=y

#CONFIG_COMPILER_OPTIMIZATION_SIZE=y

#CONFIG_ESP_WIFI_SOFTAP_SUPPORT=n

#CONFIG_ESP_SYSTEM_EVENT_TASK_STACK_SIZE=4096
#CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192

#CONFIG_MBEDTLS_DHM_C=y